[
    {
        "title": "MansaTV - a streaming platform",
        "description": "I work on MansaTv, a streaming service where I lead our engineering effort to integrate FAST channels into our content platforms. I also build features to improve the content management experience and designed its state management and testing framework to streamline the app’s efficiency. We registered approximately 55% improvement in the acquisition, throughput, reach, and retention",
        "link": "https://www.mansa.com",
        "images": ["mansa/p1.png", "mansa/mansa-auth.png", "mansa/mansa-scenes.png", "mansa/mansa-settings.png"],
        "skills": ["React", "NextJs", "NodeJs", "TypeScript", "Jest", "Redux", "AWS", "Notion", "Selenium"]
    },
    {
        "title": "Inspire SleepSync - a medical system",
        "description": "Inspire SleepSync is a cloud-based system for managing Inspire theraphy (implant technology that is used for obstructive sleep apnea treatment) patients. I built components to monitor & evalluate therapy usage data and building intuitive charts and graphs.",
        "link": "https://www.inspiresleep.com",
        "images": ["inspire/patient-tab.png", "inspire/report-tab.png", "inspire/evaluation-tab.png", "inspire/practice-tab.png"],
        "skills": ["React", "NodeJs", "TypeScript", "Laravel", "PHP", "Postgres", "Azure"]
    },
    {
        "title": "MetaDent - a dental management system",
        "description": "Metadent is a Dutch software company that offers digitalized easy-to-use solutions for dental practices. I worked on application modules that included patient onboarding, waiting room management via treatment modules, invoicing, payments, statistics, multi user agenda, accounting and salary administration. This work simplified workflows, enhanced patient experience, and boosted operational efficiency for clients in the Netherlands, East Africa, and the Philippines.",
        "link": "https://www.metadent.nl/en",
        "images": ["metadent/p1.jpg", "metadent/p2.jpg", "metadent/p3.jpg", "metadent/p4.jpg"],
        "skills": ["React", "NodeJs", "TypeScript", "Laravel", "PHP", "Postgres", "Azure"]
    },
    {
        "title": "Lenderly - a FinTech system",
        "description": "Lenderly is an emerging local start-up dedicated to making a positive impact on the lives of Filipinos by extending accessible and tailored loan services. My role was to integrate paynamics payments gateway for money remittance and build the auto-ID verification component of the application using MATI APIs, This work expanded the Lenderly client based and enabled them to register and get loans faster. Lenderly Finance Corporation is operating in the Philippines.",
        "link": "https://lenderly.ph",
        "images": ["lenderly/company-page.png", "lenderly/login-page.png", "lenderly/home-page.png"],
        "skills": ["React", "NodeJs", "TypeScript", "Laravel", "PHP"]
    }
]